benchmark/CVE-2020-25368/CVE-2020-25368.yml

vulnerability_id: CVE-2020-25368
affected_vendor: D-Link
firmware_version: DIR-823G
firmware_architecture: MIPS32
file_system: Squashfs
vulnerability_type: Command Injection
vulnerability_score: 9.8
vulnerability_severity: Critical
CWE_type: CWE-78
communication_protocol: SOAP、HNAP
simulation_method: fat
vulnerability_description: A command injection vulnerability was discovered in the HNAP1 protocol in D-Link DIR-823G devices with firmware V1.0.2B05. An attacker is able to execute arbitrary web scripts via shell metacharacters in the PrivateLogin field to Login.
firmware_link: https://driver.zol.com.cn/down/465431_86_9_localdown.shtml
fuzz_seed: |
  POST /HNAP1/ HTTP/1.1
  Host: 192.168.0.1
  User-Agent: Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:80.0) Gecko/20100101 Firefox/80.0
  Accept: */*
  Accept-Language: en-US,en;q=0.5 
  Accept-Encoding: gzip, deflate
  Content-Type: text/xml; charset=utf-8
  SOAPAction: "http://purenetworks.com/HNAP1/Login"
  X-Requested-With: XMLHttpRequest
  Content-Length: 433
  Origin: http://192.168.0.1
  Connection: close
  Referer: http://192.168.0.1/Login.html

  <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><Login xmlns="http://purenetworks.com/HNAP1/"><Action>request</Action><Username>Admin</Username><LoginPassword></LoginPassword><Captcha></Captcha><PrivateLogin>aaaa</PrivateLogin></Login></soap:Body></soap:Envelope>
